AYCXJY/STM32F103C8T6-SX1281/src/tx_main.cpp
// 日期：2024年10月25日

// 完成项：
// 默认绑定与换绑（使用EEPROM存储UID）（使用OTA封装发送绑定包）
// FHSS跳频通信
// 可选通信速率（Lora MAX -> 500HZ）
// 同步和断线重连
// 无线双向透传功能（Bug：从串口一次性传输15字节及以上数据时会堵塞乱套）

// 可选功能项：
// 使用Stubborn实现可靠数据传输
// 通道数据填充与解析
// 链路质量

// 优化项：
// 动态功率降低功耗
// logging调试库的使用

/* ELRS include */

#include "rxtx_common.h"

// #include "CRSFHandset.h"
// #include "dynpower.h"
// #include "lua.h"
#include "msp.h"
#include "msptypes.h"
#include "telemetry_protocol.h"
#include "stubborn_receiver.h"
#include "stubborn_sender.h"

// #include "devHandset.h"
// #include "devLED.h"
// #include "devScreen.h"
// #include "devBuzzer.h"
// #include "devBLE.h"
// #include "devLUA.h"
// #include "devWIFI.h"
// #include "devButton.h"
// #include "devVTX.h"
// #include "devGsensor.h"
// #include "devThermal.h"
// #include "devPDET.h"
// #include "devBackpack.h"

// #include "MAVLink.h"

/* User include */

#include <Adafruit_SSD1306.h>
#include "TimerInterrupt_Generic.h"

/* ELRS variable */

#define MSP_PACKET_SEND_INTERVAL 10LU

MSP msp;
ELRS_EEPROM eeprom;

FIFO<AP_MAX_BUF_LEN> apInputBuffer;
FIFO<AP_MAX_BUF_LEN> apOutputBuffer;

#define UART_INPUT_BUF_LEN 1024
FIFO<UART_INPUT_BUF_LEN> uartInputBuffer;

// Buffer for current stubbon sender packet (mavlink only)
uint8_t mavlinkSSBuffer[CRSF_MAX_PACKET_LEN]; 

bool NextPacketIsMspData = false;  

#define syncSpamAmount 3
#define syncSpamAmountAfterRateChange 10
volatile uint8_t syncSpamCounter = 0;
volatile uint8_t syncSpamCounterAfterRateChange = 0;
uint32_t rfModeLastChangedMS = 0;
uint32_t SyncPacketLastSent = 0;


volatile uint32_t LastTLMpacketRecvMillis = 0;
uint32_t TLMpacketReported = 0;
static bool commitInProgress = false;

LQCALC<25> LQCalc;

// volatile bool busyTransmitting;
static volatile bool ModelUpdatePending;

uint8_t MSPDataPackage[5];
#define BindingSpamAmount 25
static uint8_t BindingSendCount;
bool RxWiFiReadyToSend = false;

bool headTrackingEnabled = false;
#if !defined(CRITICAL_FLASH)
static uint16_t ptrChannelData[3] = {CRSF_CHANNEL_VALUE_MID, CRSF_CHANNEL_VALUE_MID, CRSF_CHANNEL_VALUE_MID};
static uint32_t lastPTRValidTimeMs;
#endif

static TxTlmRcvPhase_e TelemetryRcvPhase = ttrpTransmitting;
StubbornReceiver TelemetryReceiver;
StubbornSender MspSender;
uint8_t CRSFinBuffer[CRSF_MAX_PACKET_LEN+1];

/* User variable */

#define OLED_RESET 4
#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 64
Adafruit_SSD1306 display(OLED_RESET);

#define AIRRATE RATE_LORA_333HZ_8CH
#define BUADRATE 14400

uint16_t fullScount;
uint16_t fullSfreq;
uint16_t fullRcount;
uint16_t fullRfreq;
uint16_t sendcount;
uint16_t sendfreq;
uint16_t receivecount;
uint16_t receivefreq;

uint8_t CRCvalue;

uint8_t waitforTimSyncount;

#define TIMER_INTERVAL_MS 1000000
STM32Timer ITimer(TIM2);

/* ELRS Function*/

bool ICACHE_RAM_ATTR ProcessTLMpacket(SX12xxDriverCommon::rx_status const status)
{
  if (status != SX12xxDriverCommon::SX12XX_RX_OK)
  {
    Serial.println("TLM HW CRC error");
    // DBGLN("TLM HW CRC error");
    return false;
  }

  OTA_Packet_s * const otaPktPtr = (OTA_Packet_s * const)Radio.RXdataBuffer;
  if (!OtaValidatePacketCrc(otaPktPtr))
  {
    Serial.println("TLM crc error");
    return false;
  }

  if (otaPktPtr->std.type != PACKET_TYPE_TLM)
  {
    Serial.println("TLM type error " + String(otaPktPtr->std.type));
    return false;
  }

  LastTLMpacketRecvMillis = millis();
  // LQCalc.add();

  // Radio.GetLastPacketStats();
  // CRSF::LinkStatistics.downlink_SNR = SNR_DESCALE(Radio.LastPacketSNRRaw);
  // CRSF::LinkStatistics.downlink_RSSI_1 = Radio.LastPacketRSSI;
  // CRSF::LinkStatistics.downlink_RSSI_2 = Radio.LastPacketRSSI2;

  // Full res mode
  if (OtaIsFullRes)
  {
    // OTA_Packet8_s * const ota8 = (OTA_Packet8_s * const)otaPktPtr;
    // uint8_t *telemPtr;
    // uint8_t dataLen;
    // if (ota8->tlm_dl.containsLinkStats)
    // {
    //   LinkStatsFromOta(&ota8->tlm_dl.ul_link_stats.stats);
    //   telemPtr = ota8->tlm_dl.ul_link_stats.payload;
    //   dataLen = sizeof(ota8->tlm_dl.ul_link_stats.payload);
    // }
    // else
    {
      // if (firmwareOptions.is_airport)
      if(otaPktPtr->full.airport.count)
      {
        OtaUnpackAirportData(otaPktPtr, &apOutputBuffer);
        receivecount++;
        return true;
      }
      // telemPtr = ota8->tlm_dl.payload;
      // dataLen = sizeof(ota8->tlm_dl.payload);
    }
    // //DBGLN("pi=%u len=%u", ota8->tlm_dl.packageIndex, dataLen);
    // TelemetryReceiver.ReceiveData(ota8->tlm_dl.packageIndex & ELRS8_TELEMETRY_MAX_PACKAGES, telemPtr, dataLen);
  }
  // Std res mode
  else
  {
    switch (otaPktPtr->std.tlm_dl.type)
    {
      // case ELRS_TELEMETRY_TYPE_LINK:
      //   LinkStatsFromOta(&otaPktPtr->std.tlm_dl.ul_link_stats.stats);
      //   break;

      case ELRS_TELEMETRY_TYPE_DATA:
        // if (firmwareOptions.is_airport)
        {
          OtaUnpackAirportData(otaPktPtr, &apOutputBuffer);
          receivecount++;
          return true;
        }
        // TelemetryReceiver.ReceiveData(otaPktPtr->std.tlm_dl.packageIndex & ELRS4_TELEMETRY_MAX_PACKAGES,
        //   otaPktPtr->std.tlm_dl.payload,
        //   sizeof(otaPktPtr->std.tlm_dl.payload));
        break;
    }
  }

  return true;
}

void ICACHE_RAM_ATTR GenerateSyncPacketData(OTA_Sync_s * const syncPtr) // ELRS移植，注释源码另起修改
{
  // const uint8_t SwitchEncMode = config.GetSwitchMode();
  // const uint8_t Index = (syncSpamCounter) ? config.GetRate() : ExpressLRS_currAirRate_Modparams->index;

  // if (syncSpamCounter)
  //   --syncSpamCounter;

  // if (syncSpamCounterAfterRateChange && Index == ExpressLRS_currAirRate_Modparams->index)
  // {
  //   --syncSpamCounterAfterRateChange;
  //   if (connectionState == connected) // We are connected again after a rate change.  No need to keep spaming sync.
  //     syncSpamCounterAfterRateChange = 0;
  // }

  // SyncPacketLastSent = millis();

  // expresslrs_tlm_ratio_e newTlmRatio = UpdateTlmRatioEffective();

  syncPtr->fhssIndex = FHSSgetCurrIndex();
  syncPtr->nonce = OtaNonce;
  // syncPtr->rateIndex = Index;
  // syncPtr->newTlmRatio = newTlmRatio - TLM_RATIO_NO_TLM;
  // syncPtr->switchEncMode = SwitchEncMode;
  syncPtr->UID3 = UID[3];
  syncPtr->UID4 = UID[4];
  syncPtr->UID5 = UID[5];

  // // For model match, the last byte of the binding ID is XORed with the inverse of the modelId
  // if (!InBindingMode && config.GetModelMatch())
  // {
  //   syncPtr->UID5 ^= (~CRSFHandset::getModelID()) & MODELMATCH_MASK;
  // }
}

