AYCXJY/STM32F103C8T6-SX1281/src/tx_main.cpp
    // Start transmitting again
    hwTimer::resume();

    Serial.println("Entered binding mode at freq = " + String(Radio.currFreq));
//   DBGLN("Entered binding mode at freq = %d", Radio.currFreq);
}

static void ExitBindingMode() // ELRS移植，注释源码另起修改
{
    if (!InBindingMode)
        return;
    // 熄灭LED
    digitalWrite(PC13, 1);

    // MspSender.ResetState();

    // Reset CRCInit to UID-defined value
    OtaUpdateCrcInitFromUid();
    // Clear binding mode before SetRFLinkRate() for correct IQ
    InBindingMode = false; 
    
    //return to original rate
    SetRFLinkRate(enumRatetoIndex(AIRRATE));
    // SetRFLinkRate(config.GetRate()); 

    Serial.println("Exiting binding mode");
//   DBGLN("Exiting binding mode");
  // waitforTimSyncount = 2;
}

static void setupBindingFromConfig() // ELRS移植，注释源码另起修改
{
//   if (firmwareOptions.hasUID)
//   {
//       memcpy(UID, firmwareOptions.uid, UID_LEN);
//   }
//   else
  {
#ifdef PLATFORM_ESP32
    esp_read_mac(UID, ESP_MAC_WIFI_STA);
#elif PLATFORM_STM32
    UID[0] = (uint8_t)HAL_GetUIDw0();
    UID[1] = (uint8_t)(HAL_GetUIDw0() >> 8);
    UID[2] = (uint8_t)HAL_GetUIDw1();
    UID[3] = (uint8_t)(HAL_GetUIDw1() >> 8);
    UID[4] = (uint8_t)HAL_GetUIDw2();
    UID[5] = (uint8_t)(HAL_GetUIDw2() >> 8);
#endif
  }
    Serial.print("UID ");
    for (int i = 0; i < sizeof(UID); i++)
        Serial.print(String(UID[i]) + " ");
    Serial.println();
//   DBGLN("UID=(%d, %d, %d, %d, %d, %d)",
//     UID[0], UID[1], UID[2], UID[3], UID[4], UID[5]);

  OtaUpdateCrcInitFromUid();
}

/* User Function */

void displayDebugInfo()
{
    display.clearDisplay();
    if (InBindingMode)
    {
        display.setCursor(0, 0);
        display.println("sending UID...");
    }
    else
    {
        // UID
        display.setCursor(0, 0);
        display.println("ID");
        display.setCursor(18, 0);
        display.println(UID[2]);
        display.setCursor(42, 0);
        display.println(UID[3]);
        display.setCursor(66, 0);
        display.println(UID[4]);
        display.setCursor(90, 0);
        display.println(UID[5]);
        // send freq
        display.setCursor(0, 16);
        display.println("Send");
        display.setCursor(30, 16);
        display.println(sendfreq);
        // full Send freq
        display.setCursor(54, 16);
        display.println("FullS");
        display.setCursor(92, 16);
        display.println(fullSfreq); 
        // receive freq
        display.setCursor(0, 24);
        display.println("Recv");
        display.setCursor(30, 24);
        display.println(receivefreq);  
        // full Recv freq
        display.setCursor(54, 24);
        display.println("FullR");
        display.setCursor(92, 24);
        display.println(fullRfreq);
    }
    // Freq
    display.setCursor(0, 8);
    display.println("FQ");
    display.setCursor(18, 8);
    display.println(Radio.currFreq);
    // Channel
    display.setCursor(76, 8);
    display.println("CH");
    display.setCursor(94, 8);
    display.println(FHSSgetCurrIndex());
    display.display();
}

void handleButtonPress(void)
{
    delay(25);
    if (digitalRead(PB1) == 0)
    {
        while (digitalRead(PB1) == 0)
            ;
        delay(25);
        EnterBindingMode();
    }
}

void setupBasicHardWare(void)
{
    // UART
    Serial.begin(BUADRATE);
    // LED
    pinMode(PC13, OUTPUT);
    digitalWrite(PC13, HIGH);
    // Button
    pinMode(PB1, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PB1), handleButtonPress, FALLING);
    // OLED
    Wire.setSCL(PB8);
    Wire.setSDA(PB9);
    Wire.begin();
    display.begin(SSD1306_SWITCHCAPVCC, 0x3C);
    display.setTextSize(1);
    display.setTextColor(WHITE);
    display.clearDisplay();
    display.display();
    // sx1280 GPIO
    pinMode(GPIO_PIN_TX_EN, OUTPUT);
    pinMode(GPIO_PIN_RX_EN, OUTPUT);
}


/* setup and loop */

void setup()
{
    setupBasicHardWare();

    setupBindingFromConfig();

    FHSSrandomiseFHSSsequence(uidMacSeedGet());

    Radio.TXdoneCallback = &TXdoneISR;
    Radio.RXdoneCallback = &RXdoneISR;

    Radio.currFreq = FHSSgetInitialFreq();

    Radio.Begin(FHSSgetMinimumFreq(), FHSSgetMaximumFreq());

    // TelemetryReceiver.SetDataToReceive(CRSFinBuffer, sizeof(CRSFinBuffer));

    SetRFLinkRate(enumRatetoIndex(AIRRATE));

    hwTimer::init(nullptr, HWtimerCallbackTock);
    hwTimer::resume();
    ExpressLRS_currTlmDenom = 2;
}

void loop()
{
    // uint32_t now = millis();
    // only send msp data when binding is not active
    // static bool mspTransferActive = false;
    if (InBindingMode)
    {
        // exit bind mode if package after some repeats
        if (BindingSendCount > BindingSpamAmount)
        {
            ExitBindingMode();
        }
    }
    //     else if (!MspSender.IsActive())
    //     {
    //         // sending is done and we need to update our flag
    //         if (mspTransferActive)
    //         {
    //             // unlock buffer for msp messages
    //             CRSF::UnlockMspMessage();
    //             mspTransferActive = false;
    //         }
    //         // we are not sending so look for next msp package
    //         else
    //         {
    //             uint8_t* mspData;
    //             uint8_t mspLen;
    //             CRSF::GetMspMessage(&mspData, &mspLen);
    //             // if we have a new msp package start sending
    //             if (mspData != nullptr)
    //             {
    //                 MspSender.SetDataToTransmit(mspData, mspLen);
    //                 mspTransferActive = true;
    //             }
    //         }
    //     }
    
    displayDebugInfo();
}
